dompap-core/src/test/resources/test-order-accepted.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing"><env:Header><serviceContext xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:h="http://servicecontext.ntpsoa.nordea.com/object" schemaVersion="1.0" xmlns="http://servicecontext.ntpsoa.nordea.com/object">
            <h:userId>NXUPCL</h:userId>
            <h:technicalUserId></h:technicalUserId>
            <h:sessionId>e1f49827-c8c8-4209-9ba2-14cc30dffdee</h:sessionId>
            <h:requestId></h:requestId>
            <h:applicationId>NXUPCL</h:applicationId>
            <h:channelId>BRANCH</h:channelId>
            <h:clientType>JPF</h:clientType>
            <h:clientComponent>UploadClient</h:clientComponent>
            <h:clientComponentVersion>1.0</h:clientComponentVersion>
            <h:clientAction>sendDocument</h:clientAction>
            <h:clientView></h:clientView>
            <h:processInstance></h:processInstance>
            <h:authMethod>NINAA</h:authMethod>
            <h:officeMode>OFFICE</h:officeMode>
            <h:userLocation></h:userLocation>
            <h:branch>2427</h:branch>
            <h:customer>4621659753</h:customer>
            <h:employee>G93283</h:employee>
            <h:requestDomain>DK</h:requestDomain>
            <h:messageTimeStamp>2015-10-21T14:45:59</h:messageTimeStamp>
            <h:auditCategory></h:auditCategory>
            <h:test>true</h:test>
            <h:testParams xsi:nil="true"/>
            <h:accountingUnit>1050002107</h:accountingUnit>
        </serviceContext><wsa:To>http://10.139.16.24:8080/documentbox/callback/services/nds</wsa:To>
        <wsa:Action>reportEvent</wsa:Action>
        <wsa:MessageID>urn:B381093077F111E5BFA24D0D93D360F5</wsa:MessageID>
        <wsa:RelatesTo>urn:B381093077F111E5BFA24D0D93D360F5</wsa:RelatesTo>
        <wsa:ReplyTo>
        	<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
        	<wsa:ReferenceParameters>
        		<instra:tracking.ecid xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">7224a10e6b00a650:-65267903:1507f744ce8:-8000-000000000004ac7c</instra:tracking.ecid>
        		<instra:tracking.conversationId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">urn:B381093077F111E5BFA24D0D93D360F5</instra:tracking.conversationId>
        		<instra:tracking.parentComponentInstanceId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">reference:6001073</instra:tracking.parentComponentInstanceId>
        		<instra:tracking.compositeInstanceCreatedTime xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">2015-10-21T14:46:00.520+02:00</instra:tracking.compositeInstanceCreatedTime>
        	</wsa:ReferenceParameters>
        </wsa:ReplyTo>
      </env:Header>
      <env:Body>
      	<reportEventRequest xmlns:soehs="http://digitalsigning.ntp.nordea.com/signordereventhandler/service/v2" xmlns="http://digitalsigning.ntp.nordea.com/signordereventhandler/service/v2">
      	<eventOccured xmlns="">2015-10-21T14:46:08+02:00</eventOccured>
      	<eventReported xmlns="">2015-10-21T14:46:08+02:00</eventReported>
      	<documentURI xmlns="">http://archivesrest.site.midas.root4.net:7501/archives/rest/1.0/read/find/content?genDocumentKey=NBAgSDDK1l58nhhq3m08c&amp;entity=CustomerDokDK</documentURI>
      	<event xmlns="">order.accepted</event>
      	<message xmlns="">Order created in eBoks</message>
      	<recipientList xmlns=""><recipient><nationalPersonId>0505550673</nationalPersonId><countryCode>DK</countryCode></recipient></recipientList>
      	</reportEventRequest>
      	</env:Body>
     	</env:Envelope>